vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.EFR32MG12P_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4.9" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>https://www.keil.com/pack/</url>
  <name>EFR32MG12P_DFP</name>
  <description>Silicon Labs EFR32 Migthy Gecko Series Device Support</description>

  <releases>
    <release version="1.0.1" date="2023-09-04" deprecated="2023-09-04">
      This Software Pack is no longer maintained.
	</release>
    <release version="1.0.0" date="2017-06-22">
      Initial Release of EFR32MG12P Device Family Pack.
      Device support files V5.1.3.
      Flash Algorithms 5.2.0.
      SVD files V5.2.1.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Silicon Labs</keyword>
    <keyword>EFR32MG12P</keyword>
    <keyword>EFM32</keyword>
  </keywords>

  <devices>
    <family Dfamily="EFR32MG12P Series" Dvendor="Silicon Labs:21">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
      <processor Dclock="40000000"/>

      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>

      <book name="Documents/DUI0552A_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
      <book name="Documents/efr32xg12-rm.pdf"            title="EFR32xG12P Reference Manual"/>

      <description>
The Mighty Gecko family of wireless solutions.
      </description>

      <!-- ************************  Subfamily 'EFR32MG12P433'  **************************** -->
      <subFamily DsubFamily="EFR32MG12P433">

        <!-- *************************  Device 'EFR32MG12P433F1024GL125'  ***************************** -->
        <device Dname="EFR32MG12P433F1024GL125">
          <compile header="Device/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P433F1024GL125"/>
          <debug svd="SVD/EFR32MG12P/EFR32MG12P433F1024GL125.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOS1.FLM" start="0x00000000" size="0x00100000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32MG12P433F1024GM48'  ***************************** -->
        <device Dname="EFR32MG12P433F1024GM48">
          <compile header="Device/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P433F1024GM48"/>
          <debug svd="SVD/EFR32MG12P/EFR32MG12P433F1024GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOS1.FLM" start="0x00000000" size="0x00100000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFR32MG12P432'  **************************** -->
      <subFamily DsubFamily="EFR32MG12P432">

        <!-- *************************  Device 'EFR32MG12P432F1024GL125'  ***************************** -->
        <device Dname="EFR32MG12P432F1024GL125">
          <compile header="Device/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P432F1024GL125"/>
          <debug svd="SVD/EFR32MG12P/EFR32MG12P432F1024GL125.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOS1.FLM" start="0x00000000" size="0x00100000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32MG12P432F1024GM48'  ***************************** -->
        <device Dname="EFR32MG12P432F1024GM48">
          <compile header="Device/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P432F1024GM48"/>
          <debug svd="SVD/EFR32MG12P/EFR32MG12P432F1024GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOS1.FLM" start="0x00000000" size="0x00100000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFR32MG12P332'  **************************** -->
      <subFamily DsubFamily="EFR32MG12P332">

        <!-- *************************  Device 'EFR32MG12P332F1024GL125'  ***************************** -->
        <device Dname="EFR32MG12P332F1024GL125">
          <compile header="Device/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P332F1024GL125"/>
          <debug svd="SVD/EFR32MG12P/EFR32MG12P332F1024GL125.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOS1.FLM" start="0x00000000" size="0x00100000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32MG12P332F1024GM48'  ***************************** -->
        <device Dname="EFR32MG12P332F1024GM48">
          <compile header="Device/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P332F1024GM48"/>
          <debug svd="SVD/EFR32MG12P/EFR32MG12P332F1024GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOS1.FLM" start="0x00000000" size="0x00100000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>
      </subFamily>

