vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.EFR32MG12P_DFP.pdsc
      <!-- ************************  Subfamily 'EFR32MG12P232'  **************************** -->
      <subFamily DsubFamily="EFR32MG12P232">

        <!-- *************************  Device 'EFR32MG12P232F1024GL125'  ***************************** -->
        <device Dname="EFR32MG12P232F1024GL125">
          <compile header="Device/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P232F1024GL125"/>
          <debug svd="SVD/EFR32MG12P/EFR32MG12P232F1024GL125.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOS1.FLM" start="0x00000000" size="0x00100000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32MG12P232F1024GM48'  ***************************** -->
        <device Dname="EFR32MG12P232F1024GM48">
          <compile header="Device/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P232F1024GM48"/>
          <debug svd="SVD/EFR32MG12P/EFR32MG12P232F1024GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOS1.FLM" start="0x00000000" size="0x00100000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFR32MG12P132'  **************************** -->
      <subFamily DsubFamily="EFR32MG12P132">

        <!-- *************************  Device 'EFR32MG12P132F1024GL125'  ***************************** -->
        <device Dname="EFR32MG12P132F1024GL125">
          <compile header="Device/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P132F1024GL125"/>
          <debug svd="SVD/EFR32MG12P/EFR32MG12P132F1024GL125.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOS1.FLM" start="0x00000000" size="0x00100000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>

        <!-- *************************  Device 'EFR32MG12P132F1024GM48'  ***************************** -->
        <device Dname="EFR32MG12P132F1024GM48">
          <compile header="Device/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P132F1024GM48"/>
          <debug svd="SVD/EFR32MG12P/EFR32MG12P132F1024GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00040000" init   ="0" default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="Flash/GECKOS1.FLM" start="0x00000000" size="0x00100000"             default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EFR32MG12P">
      <description>Silicon Labs EFR32MG12P devices</description>
      <require Dvendor="Silicon Labs:21" Dname="EFR32MG12P*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="EFR32MG12P CMSIS">
      <description>Silicon Labs EFR32MG12P devices, CMSIS Core</description>
      <require condition="EFR32MG12P"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + CMSIS + Compiler Conditions -->
    <condition id="EFR32MG12P CMSIS GCC">
      <description>Silicon Labs EFR32MG12P devices, CMSIS Core, GCC compiler</description>
      <require condition="EFR32MG12P CMSIS"/>
      <require condition="Compiler GCC"/>
    </condition>

    <!-- emlib Conditions -->
    <condition id="emlib Framework">
      <description>Silicon Labs emlib Framework</description>
      <require condition="EFR32MG12P"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
    </condition>
    <condition id="emlib SYSTEM">
      <description>Silicon Labs emlib with SYSTEM</description>
      <require condition="EFR32MG12P"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition>
    <condition id="emlib EMU">
      <description>Silicon Labs emlib with EMU</description>
      <require condition="EFR32MG12P"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="EMU"/>
    </condition>
    <condition id="emlib CMU">
      <description>Silicon Labs emlib with CMU</description>
      <require condition="EFR32MG12P"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
    </condition>
    <condition id="emlib CMU SYSTEM">
      <description>Silicon Labs emlib with CMU, SYSTEM</description>
      <require condition="EFR32MG12P"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition>
    <condition id="emlib CMU SYSTEM CORE">
      <description>Silicon Labs emlib with CMU, SYSTEM, CORE</description>
      <require condition="EFR32MG12P"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CORE"/>
    </condition>
    <condition id="emlib CMU GPIO">
      <description>Silicon Labs emlib with CMU, GPIO</description>
      <require condition="EFR32MG12P"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="GPIO"/>
    </condition>
